{
  "architectures": [
    "DeepseekV2ForCausalLM"
  ],
  "attention_bias": false, // confirm model.safetensor.json
  "attention_dropout": 0.0, // I guess exllamav2 don't have it
  "auto_map": {
    "AutoConfig": "configuration_deepseek.DeepseekV2Config",
    "AutoModel": "modeling_deepseek.DeepseekV2Model",
    "AutoModelForCausalLM": "modeling_deepseek.DeepseekV2ForCausalLM"
  },
  "aux_loss_alpha": 0.001, // MoeGate alpha
  "bos_token_id": 100000,
  "eos_token_id": 100001,
  "ep_size": 1, // MoEMLP
  "first_k_dense_replace": 1, // don't need
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 12288,
  "kv_lora_rank": 512, // KVCache size
  "max_position_embeddings": 163840,
  "model_type": "deepseek_v2",
  "moe_intermediate_size": 1536,
  "moe_layer_freq": 1,
  "n_group": 8, // MoeGate 
  "n_routed_experts": 160,
  "n_shared_experts": 2,
  "norm_topk_prob": false,
  "num_attention_heads": 128,
  "num_experts_per_tok": 6,
  "num_hidden_layers": 60,
  "num_key_value_heads": 128,
  "pretraining_tp": 1, // don't need
  "q_lora_rank": 1536, 
  "qk_nope_head_dim": 128, // q size
  "qk_rope_head_dim": 64,// attn
  "rms_norm_eps": 1e-06,
  "rope_scaling": {
    "beta_fast": 32,
    "beta_slow": 1,
    "factor": 40,
    "mscale": 1.0,
    "mscale_all_dim": 1.0,
    "original_max_position_embeddings": 4096,
    "type": "yarn"
  },
  "rope_theta": 10000,
  "routed_scaling_factor": 16.0, // MoeGate
  "scoring_func": "softmax",
  "seq_aux": true, // MoeGate
  "tie_word_embeddings": false, // don't need
  "topk_group": 3, // MoeGate
  "topk_method": "group_limited_greedy", // MoeGate
  "torch_dtype": "bfloat16",
  "transformers_version": "4.39.3",
  "use_cache": true,
  "v_head_dim": 128, // attn
  "vocab_size": 102400
}
